# Практическое задание по уроку "Базовые структуры данных"
# Задача «Длина слова»
a = str(input())
b = len(a)
print(b)
# ответ:
# Решение:
# num = int(input())
# str_num = str(num)
# length = len(str_num)
# print(length)
